"""
Реализовать простое клиент-серверное взаимодействие по протоколу JIM (JSON instant messaging):

    клиент отправляет запрос серверу;
    сервер отвечает соответствующим кодом результата. Клиент и сервер должны быть реализованы в виде отдельных
    скриптов, содержащих соответствующие функции. Функции клиента: сформировать presence-сообщение; отправить
    сообщение серверу; получить ответ сервера; разобрать сообщение сервера; параметры командной строки скрипта
    client.py <addr> [<port>]: addr — ip-адрес сервера; port — tcp-порт на сервере, по умолчанию 7777. Функции
    сервера: принимает сообщение клиента; формирует ответ клиенту; отправляет ответ клиенту; имеет параметры
    командной строки: -p <port> — TCP-порт для работы (по умолчанию использует 7777); -a <addr> — IP-адрес для
    прослушивания (по умолчанию слушает все доступные адреса).

"""

import socket
import sys
import json
from variables import MAX_CONNECTIONS, DEFAULT_PORT, RESPONSE, TIME, PRESENCE, USER, ACCOUNT_NAME, ACTION, ERROR, CLOSE
from utils import send_message, get_message


def process_client_message(message):

    if ACTION in message and message[ACTION] == PRESENCE and TIME in message \
            and USER in message and message[USER][ACCOUNT_NAME] == 'Guest':
        return {RESPONSE: 200}
    if ACTION in message and message[ACTION] == CLOSE and TIME in message \
            and USER in message and message[USER][ACCOUNT_NAME] == 'Guest':
        return False
    return {RESPONSE: 400, ERROR: 'Bad Request'}

def main():
    try:
        if '-p' in sys.argv:
            listen_port = int(sys.argv[sys.argv.index('-p') + 1])
        else:
            listen_port = DEFAULT_PORT
        if listen_port < 1024 or listen_port > 65535:
            raise ValueError
    except IndexError:
        print('После параметра -\'p\' необходимо указать номер порта.')
        sys.exit(1)
    except ValueError:
        print('В качестве порта может быть указано целое число в диапазоне от 1024 до 65535.')
        sys.exit(1)

    try:
        if '-a' in sys.argv:
            listen_address = sys.argv[sys.argv.index('-a') + 1]
        else:
            listen_address = ''

    except IndexError:
        print(
            'После параметра \'a\'- необходимо указать адрес, который будет слушать сервер.')
        sys.exit(1)

    transport = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
    transport.bind((listen_address, listen_port))

    transport.listen(MAX_CONNECTIONS)

    while True:
        client, client_address = transport.accept()
        try:
            message_from_cient = get_message(client)
            print(message_from_cient)
            if not message_from_cient:
                sys.exit()

            response = process_client_message(message_from_cient)
            if not response:
                sys.exit()
            send_message(client, response)
            client.close()
        except (ValueError, json.JSONDecodeError):
            print('Принято некорретное сообщение от клиента.')
            client.close()



if __name__ == '__main__':
    main()
